---
kind: property
id: P:Autodesk.Revit.DB.PlanTopologySet.IsEmpty
source: html/397ac42f-e3d8-464c-d9c6-50cd4a1df46c.htm
---
# Autodesk.Revit.DB.PlanTopologySet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.